# CurrentDocument Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormulaEditingEventArgs..::..CurrentDocument Property
FormulaEditingEventArgs Class See Also
---
Returns the current document
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Document CurrentDocument { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurrentDocument As Document
	Get
```

Visual C++
---
```text
public:
property Document^ CurrentDocument {
	Document^ get ();
}
```

# See Also
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace